import { Component, OnInit } from '@angular/core';
import { Router,ActivatedRoute } from '@angular/router';

@Component({
  selector: 'app-detailsongkom',
  templateUrl: './detailsongkom.component.html',
  styleUrls: ['./detailsongkom.component.css']
})
export class DetailsongkomComponent implements OnInit {

  index:any=0;
  datasongkom:any={
    titllsongkom:'',
    urlsongkom:''
  };
  detailsongkom=[
    {"titlesongkom":"៥ តំបន់នៅភ្នំពេញ សម្បូរបន្ទប់ជួល ធូរថ្លៃល្មមរស់នៅ ពេលមករៀននៅសាកលវិទ្យាល័យ​",
      "detialsongkom":"ការថែរក្សាសុខភាព គឺជាកត្តាសំខាន់សម្រាប់មនុស្សគ្រប់គ្នា មិនថាអ្នកនៅក្នុងវ័យណានោះទេ។ ប្រសិនបើអ្នកមិនចេះថែរក្សាសុខភាព តាំង​ពីវ័យក្មេងទេ អ្នកអាចប្រឈមនឹងការ​កើត​មាន​ជំងឺកាចសាហាវជាច្រើន ពេល​អ្នកមានវ័យចំណាស់ ឬអាចកើតមានទាំងក្មេងវ័យក៏ថាបានដែរ ។ដោយឡែក យុវជនមួយចំនួន​ពេល​នេះ មិនសូវជាបានគិតគូរពីការ​ថែទាំសុខភាព បញ្ហាសុខភាពរបស់ខ្លួនប៉ុន្មានទេ ហើយថែមទាំងមានទម្លាប់អាក្រក់មួយចំនួន បំផ្លាញសុខភាពរបស់ខ្លួនទៅវិញ។ កំហុសទាំងនោះមានដូចជា៖១. ចូលចិត្តញ៉ាំអាហារក្រៅផ្ទះ ៖ ប្រភេទអាហារ ដែលមានជាតិខ្លាញ់ អាហារបំពង ហឹខ្លាំង ប្រៃ ឬ ផ្អែមខ្លាំង មានរសជាតិឆ្ងាញ់ជាងម្ហូបធម្មតាដែលចម្អិននៅផ្ទះ ប៉ុន្តែផលប៉ះពាល់នៃអាហារទាំងនោះ ក៏មានច្រើនដូចគ្នា។ ការញ៉ាំអាហារទាំងនោះជាញឹកញាប់ អាចធ្វើឲ្យអ្នកមានរោគក្រពះ ជំងឺបេះដូង ជំងឺទឹកនោមផ្អែម លើសគីឡូ ជាដើម។",
      urlsongkom:"https://cdn.sabay.com/cdn/media.sabay.com/media/PR-Photos/PR-Photos(2)/News-01/News-02/News-03/5fdecfa95d487_1608437640_medium.jpg"
    },
    {"titlesongkom":"កំហុសទាំង ៥យ៉ាងដែលគ្រប់គ្នាចូលចិត្តធ្វើ ដូចបំផ្លាញសុខភាពខ្លួនឯងដោយមិនដឹងខ្លួន​",
      "detialsongkom":"កម្មវិធីជាច្រើននៅលើ App Store ត្រូវបានដាក់ឱ្យទាញយកដោយឥតគិតថ្លៃ ប៉ុន្ដែនៅក្នុងកម្មវិធីទាំងនោះច្បាស់ណាស់ នឹងមានលក់សេវាកម្ម មុខងារផ្សេងៗ ឬ items ជាច្រើនទៀត បន្ទាប់ពីអ្នកបានចូលទៅប្រើប្រាស់។ដូចនេះដើម្បីដឹងកាន់តែច្បាស់ ថាក្នុងកម្មវិធី ឬហ្គេមទាំងនោះមានលក់អ្វីបន្ថែម មុនសម្រេចចិត្តទាញយក លោកអ្នកអាចសាកល្បងតាម",
      urlsongkom:"https://cdn.sabay.com/cdn/media.sabay.com/media/Sophearom/youth-health/5fb4a873ddf95_1605675120_medium.jpg"
    },
    {"titlesongkom":"ខេត្តមួយនៅថៃ ចម្ងាយ ៣០០ គីឡូម៉ែត្រពីកម្ពុជា ផ្ទុះឆ្លងកូវីដ ១៩ ត្រឹម១យប់រកឃើញជិត ៦០០ នាក់",
      "detialsongkom":"ខេត្តសាមុតសាខន នៃប្រទេសថៃ ត្រូវបានគេដាក់បម្រាមគោចរចាប់ពីម៉ោង ១០ យប់ដល់ម៉ោង ៥ ព្រឹករហូតដល់ថ្ងៃទី ៣ ខែមករា ២០២១ បន្ទាប់ពីមានការកើនឡើងជាង ៥៤០ ករណីនៃ Covid-19 កាលពីថ្ងៃសៅរ៍ ទី១៩ ខែធ្នូ ២០២០នេះ ។នកឆ្លងវីរុសកូវីដ ១៩ ទាំងអស់នេះ ពួកគេភាគច្រើនជាពលករចំណាកស្រុកមកពីប្រទេសភូមា ។ ខេត្តសមុទ្រសាខនជាប់ព្រំដែនជាមួយប្រទេសភូមា និងមានចម្ងាយពីប្រទេសកម្ពុជាប្រមាណ៣០០ គីឡូម៉ែត ។ នេះបើតាមការចុះផ្សាយរបស់នាយកដ្ឋានប្រយុទ្ធជំងឺឆ្លង នៃក្រសួងសុខាភិបាលកម្ពុជា ។",
      urlsongkom:"https://cdn.sabay.com/cdn/media.sabay.com/media/TECH-KK/KOSAL/5fdc6e5a44de3_1608281640_medium.jpg"
    },
    {"titlesongkom":"ម្ទៅលេងកំពត បើមិនបានទៅ ៥ កន្លែងនេះស្ដាយថ្លៃសាំងណាស់ ទេសភាពសុទ្ធតែស្អាតៗ",
      "detialsongkom":"កំពត គឺជាគោលដៅទេសចរណ៍ដ៏សំខាន់មួយ ដែលក្រុមការងារផ្លូវទៅស្រុក របស់ “Sabay” បានចុះទៅផ្ដិតយកនូវផ្ទាំងទស្សនីយភាពដ៏គួរឱ្យចាប់អារម្មណ៍មកចែកជូនបងប្អូនបានទស្សនា និងស្វែងយល់ពីតំបន់ដ៏មានសក្ដានុពលទាំងនោះ ។ ថ្ងៃនេះសូមបង្ហាញ ៥ កន្លែង ដែលក្រុមការងារផ្លូវទៅស្រុកវគ្គ ៣ បានទៅដល់នាពេលកន្លងមក សុទ្ធតែបង្កប់ទៅដោយរឿងរ៉ាវគួរឱ្យស្វែងយល់ ពិសេសទេសភាពស្អាតក្រៃលែង ។ ១.ល្អាងភ្នំឈ្ងោកបន្សល់ទុកពីសម័យនគរភ្នំ ភ្នំឈ្ងោក គឺជារមណីយដ្ឋានបែបប្រវត្តិសាស្រ្តមួយដ៏គួរឱ្យចាប់អារម្មណ៍នាដែនដីសម្បូរទុរេននេះ ។ ស្ថិតនៅភាគខាងត្បូងនៃប្រទេសកម្ពុជា ភ្នំឈ្ងោកមានចំងាយជាង ៥គីឡូម៉ែត្រពីបឹងប្រទាក់ក្រឡា ឬប្រមាណ ១៣គីឡូ ម៉ែត្រពីទីរួមខេត្តកំពត ។",
      urlsongkom:"https://cdn.sabay.com/cdn/media.sabay.com/media/PR-Photos/PR-Photos(2)/News-01/News-02/News-03/5fdec435a2e6e_1608434700_medium.jpg"
    },
    {"titlesongkom":"មពេជ្រមិនទាន់ច្នៃ! ក្មេងស្រីទាំង ២ រូបមកពីត្រកូលក្រខ្សត់ដូចគ្នា តែសម្រស់ពីធម្មជាតិស្អាតខ្លាំង​",
      "detialsongkom":"ថ្វីដ្បិតចេញពីត្រកូលក្រលំបាក ឆ្លងកាត់ភាពហត់នឿយទាំងវ័យក្មេង មិនបានគេងស្រណុកហូបឆ្ងាញ់ ដូចក្មេងៗនៅក្នុងត្រកូលអ្នកមានក៏ពិតមែន ប៉ុន្តែកុមារី ២ រូបនេះមានសម្រស់ពីធម្មជាតិស្អាតផូផង់ ធ្វើឱ្យមហាជនលាន់មាត់សរសើរគ្រប់គ្នា ។ កុមារីទាំង ២ រូបនោះមានដូចជា៖១.កុមារី យ៉ង់ ស្រីនីត អាយុ ១៣ ឆ្នាំស្រីនីត ជាក្មេងស្រីជនបទដាច់ស្រយាលនៅខេត្តមណ្ឌលគីរី រូបនាងត្រូវបានមហាជនផ្ទុះការចាប់អារម្មណ៍ ក្រោយរូបថតជាច្រើនសន្លឹក ត្រូវបានអ្នកប្រមាញ់រូបថត បង្ហោះនៅលើបណ្ដាញសង្គមហ្វេសប៊ុក ។ ក្មេងស្រីរូបនេះមានសម្បុរស្រអែមស្រស់ ចិញ្ចើមក្រាស់ កែវភ្នែកស្រទន់ ទម្រង់មុខស័ក្ដិសមនឹងបបូរមាត់ ទោះមិនទាន់មានការកែកុនក៏ស្អាតស្រាប់ទៅហើយ ។ ដោយសារសម្រស់ពីធម្មជាតិល្អគន់បែបនេះ ក្មេងស្រីមកពីភូមិភាគឦសានរូបនេះ បានកែប្រែវាសនារបស់ខ្លួន ហក់ចូលវិស័យសិល្បៈទាំងវ័យក្មេង ហើយថែមទាំងមានសប្បុរសជនជាច្រើនឧបត្ថម្ភជាបន្តបន្ទាប់ ពិសេសឧកញ៉ា ស្រី ចាន់ថន បានសង់ផ្ទះថ្មីឱ្យមួយខ្នង ផ្ដល់ការសិក្សា និងទទួលយកជាកូនចិញ្ចឹមទៀតផង ។",
      urlsongkom:"https://cdn.sabay.com/cdn/media.sabay.com/media/PR-Photos/PR-Photos(2)/News-01/News-02/News-03/5fdeabb0cfe28_1608428460_medium.jpg"
    },
    {"titlesongkom":"រូបភាពថ្មីៗ ពីផ្លូវល្បឿនលឿនជិះត្រឹម ២ ម៉ោងពីភ្នំពេញ ទៅកំពង់សោម មានគុណភាពមិនធម្មតាទេ​",
      "detialsongkom":"ផ្លូវល្បឿនលឿនដំបូងគេនៅកម្ពុជាពីភ្នំពេញទៅព្រះសីហនុ ប្រវែង ១៩០ គីឡូម៉ែត្រ កំពុងសម្រុកសាងសង់យ៉ាងមមាញឹក មកដល់ពេលនេះរួចរាល់ប្រមាណ ៣០% ហើយ គ្រោងនឹងបើកដំណើរការជាផ្លូវការនៅខែមីនា ឆ្នាំ ២០២៣ ខាងមុខនេះ ។",
      urlsongkom:"https://cdn.sabay.com/cdn/media.sabay.com/media/PR-Photos/PR-Photos(2)/News-01/News-02/News-03/5fddc8b433242_1608370320_medium.jpg"
    },
    {"titlesongkom":"កំហុសទាំង ៥យ៉ាងដែលគ្រប់គ្នាចូលចិត្តធ្វើ ដូចបំផ្លាញសុខភាពខ្លួនឯងដោយមិនដឹងខ្លួន​",
      "detialsongkom":"កម្មវិធីជាច្រើននៅលើ App Store ត្រូវបានដាក់ឱ្យទាញយកដោយឥតគិតថ្លៃ ប៉ុន្ដែនៅក្នុងកម្មវិធីទាំងនោះច្បាស់ណាស់ នឹងមានលក់សេវាកម្ម មុខងារផ្សេងៗ ឬ items ជាច្រើនទៀត បន្ទាប់ពីអ្នកបានចូលទៅប្រើប្រាស់។ដូចនេះដើម្បីដឹងកាន់តែច្បាស់ ថាក្នុងកម្មវិធី ឬហ្គេមទាំងនោះមានលក់អ្វីបន្ថែម មុនសម្រេចចិត្តទាញយក លោកអ្នកអាចសាកល្បងតាម",
      urlsongkom:"https://cdn.sabay.com/cdn/media.sabay.com/media/Sophearom/youth-health/5fb4a873ddf95_1605675120_medium.jpg"
    },
    {"titlesongkom":"ខេត្តមួយនៅថៃ ចម្ងាយ ៣០០ គីឡូម៉ែត្រពីកម្ពុជា ផ្ទុះឆ្លងកូវីដ ១៩ ត្រឹម១យប់រកឃើញជិត ៦០០ នាក់",
      "detialsongkom":"ខេត្តសាមុតសាខន នៃប្រទេសថៃ ត្រូវបានគេដាក់បម្រាមគោចរចាប់ពីម៉ោង ១០ យប់ដល់ម៉ោង ៥ ព្រឹករហូតដល់ថ្ងៃទី ៣ ខែមករា ២០២១ បន្ទាប់ពីមានការកើនឡើងជាង ៥៤០ ករណីនៃ Covid-19 កាលពីថ្ងៃសៅរ៍ ទី១៩ ខែធ្នូ ២០២០នេះ ។នកឆ្លងវីរុសកូវីដ ១៩ ទាំងអស់នេះ ពួកគេភាគច្រើនជាពលករចំណាកស្រុកមកពីប្រទេសភូមា ។ ខេត្តសមុទ្រសាខនជាប់ព្រំដែនជាមួយប្រទេសភូមា និងមានចម្ងាយពីប្រទេសកម្ពុជាប្រមាណ៣០០ គីឡូម៉ែត ។ នេះបើតាមការចុះផ្សាយរបស់នាយកដ្ឋានប្រយុទ្ធជំងឺឆ្លង នៃក្រសួងសុខាភិបាលកម្ពុជា ។",
      urlsongkom:"https://cdn.sabay.com/cdn/media.sabay.com/media/TECH-KK/KOSAL/5fdc6e5a44de3_1608281640_medium.jpg"
    },
    {"titlesongkom":"ម្ទៅលេងកំពត បើមិនបានទៅ ៥ កន្លែងនេះស្ដាយថ្លៃសាំងណាស់ ទេសភាពសុទ្ធតែស្អាតៗ",
      "detialsongkom":"កំពត គឺជាគោលដៅទេសចរណ៍ដ៏សំខាន់មួយ ដែលក្រុមការងារផ្លូវទៅស្រុក របស់ “Sabay” បានចុះទៅផ្ដិតយកនូវផ្ទាំងទស្សនីយភាពដ៏គួរឱ្យចាប់អារម្មណ៍មកចែកជូនបងប្អូនបានទស្សនា និងស្វែងយល់ពីតំបន់ដ៏មានសក្ដានុពលទាំងនោះ ។ ថ្ងៃនេះសូមបង្ហាញ ៥ កន្លែង ដែលក្រុមការងារផ្លូវទៅស្រុកវគ្គ ៣ បានទៅដល់នាពេលកន្លងមក សុទ្ធតែបង្កប់ទៅដោយរឿងរ៉ាវគួរឱ្យស្វែងយល់ ពិសេសទេសភាពស្អាតក្រៃលែង ។ ១.ល្អាងភ្នំឈ្ងោកបន្សល់ទុកពីសម័យនគរភ្នំ ភ្នំឈ្ងោក គឺជារមណីយដ្ឋានបែបប្រវត្តិសាស្រ្តមួយដ៏គួរឱ្យចាប់អារម្មណ៍នាដែនដីសម្បូរទុរេននេះ ។ ស្ថិតនៅភាគខាងត្បូងនៃប្រទេសកម្ពុជា ភ្នំឈ្ងោកមានចំងាយជាង ៥គីឡូម៉ែត្រពីបឹងប្រទាក់ក្រឡា ឬប្រមាណ ១៣គីឡូ ម៉ែត្រពីទីរួមខេត្តកំពត ។",
      urlsongkom:"https://cdn.sabay.com/cdn/media.sabay.com/media/PR-Photos/PR-Photos(2)/News-01/News-02/News-03/5fdec435a2e6e_1608434700_medium.jpg"
    },
    {"titlesongkom":"មពេជ្រមិនទាន់ច្នៃ! ក្មេងស្រីទាំង ២ រូបមកពីត្រកូលក្រខ្សត់ដូចគ្នា តែសម្រស់ពីធម្មជាតិស្អាតខ្លាំង​",
      "detialsongkom":"ថ្វីដ្បិតចេញពីត្រកូលក្រលំបាក ឆ្លងកាត់ភាពហត់នឿយទាំងវ័យក្មេង មិនបានគេងស្រណុកហូបឆ្ងាញ់ ដូចក្មេងៗនៅក្នុងត្រកូលអ្នកមានក៏ពិតមែន ប៉ុន្តែកុមារី ២ រូបនេះមានសម្រស់ពីធម្មជាតិស្អាតផូផង់ ធ្វើឱ្យមហាជនលាន់មាត់សរសើរគ្រប់គ្នា ។ កុមារីទាំង ២ រូបនោះមានដូចជា៖១.កុមារី យ៉ង់ ស្រីនីត អាយុ ១៣ ឆ្នាំស្រីនីត ជាក្មេងស្រីជនបទដាច់ស្រយាលនៅខេត្តមណ្ឌលគីរី រូបនាងត្រូវបានមហាជនផ្ទុះការចាប់អារម្មណ៍ ក្រោយរូបថតជាច្រើនសន្លឹក ត្រូវបានអ្នកប្រមាញ់រូបថត បង្ហោះនៅលើបណ្ដាញសង្គមហ្វេសប៊ុក ។ ក្មេងស្រីរូបនេះមានសម្បុរស្រអែមស្រស់ ចិញ្ចើមក្រាស់ កែវភ្នែកស្រទន់ ទម្រង់មុខស័ក្ដិសមនឹងបបូរមាត់ ទោះមិនទាន់មានការកែកុនក៏ស្អាតស្រាប់ទៅហើយ ។ ដោយសារសម្រស់ពីធម្មជាតិល្អគន់បែបនេះ ក្មេងស្រីមកពីភូមិភាគឦសានរូបនេះ បានកែប្រែវាសនារបស់ខ្លួន ហក់ចូលវិស័យសិល្បៈទាំងវ័យក្មេង ហើយថែមទាំងមានសប្បុរសជនជាច្រើនឧបត្ថម្ភជាបន្តបន្ទាប់ ពិសេសឧកញ៉ា ស្រី ចាន់ថន បានសង់ផ្ទះថ្មីឱ្យមួយខ្នង ផ្ដល់ការសិក្សា និងទទួលយកជាកូនចិញ្ចឹមទៀតផង ។",
      urlsongkom:"https://cdn.sabay.com/cdn/media.sabay.com/media/PR-Photos/PR-Photos(2)/News-01/News-02/News-03/5fdeabb0cfe28_1608428460_medium.jpg"
    },
    {"titlesongkom":"រូបភាពថ្មីៗ ពីផ្លូវល្បឿនលឿនជិះត្រឹម ២ ម៉ោងពីភ្នំពេញ ទៅកំពង់សោម មានគុណភាពមិនធម្មតាទេ​",
      "detialsongkom":"ផ្លូវល្បឿនលឿនដំបូងគេនៅកម្ពុជាពីភ្នំពេញទៅព្រះសីហនុ ប្រវែង ១៩០ គីឡូម៉ែត្រ កំពុងសម្រុកសាងសង់យ៉ាងមមាញឹក មកដល់ពេលនេះរួចរាល់ប្រមាណ ៣០% ហើយ គ្រោងនឹងបើកដំណើរការជាផ្លូវការនៅខែមីនា ឆ្នាំ ២០២៣ ខាងមុខនេះ ។",
      urlsongkom:"https://cdn.sabay.com/cdn/media.sabay.com/media/PR-Photos/PR-Photos(2)/News-01/News-02/News-03/5fddc8b433242_1608370320_medium.jpg"
    },
  ];
  constructor(private router:Router,private  activateRoute:ActivatedRoute) { }

  ngOnInit() {
    let index:any;
    this.activateRoute.params.subscribe(params =>{
      console.log(params['idsongkom']);
      index=params['idsongkom'];
      this.datasongkom=this.detailsongkom[index];
      console.log(this.datasongkom);

    });
  }

}
